/*
数据类型 数组名[ 行数 ][ 列数 ];
数据类型 数组名[ 行数 ][ 列数 ] = { {数据1，数据2 } ，{数据3，数据4 } };
数据类型 数组名[ 行数 ][ 列数 ] = { 数据1，数据2，数据3，数据4};
数据类型 数组名[ ][ 列数 ] = { 数据1，数据2，数据3，数据4};

*/

#include<iostream>

using namespace std;

int main(){


    int a[2][3] = { {1,2,3},{4,5,6} };
    int b[2][3] = { 1,2,3,4,5,6 };
    int c[][3] = { 1,2,3,4,5,6 };
    int d[2][3] = { {1,2},{3,4} };
    int e[2][3] = { 1,2,3,4 };
    int f[2][3] = { 1,2,3 };

    cout<<a[1][2]<<endl;
    cout<<b[1][2]<<endl;
    cout<<c[1][2]<<endl;
    cout<<d[1][2]<<endl;
    cout<<e[1][2]<<endl;
    cout<<f[1][2]<<endl;
    return 0;


}